# WorksetConfiguration Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetConfiguration Constructor
WorksetConfiguration Class See Also
---
Constructs a new workset configuration with an initial setting to open all user-created worksets.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public WorksetConfiguration()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
WorksetConfiguration()
```

# See Also
WorksetConfiguration Class
WorksetConfiguration Overload
Autodesk.Revit.DB Namespace